---
kind: other
id: Properties.T:Autodesk.Revit.UI.Events.ViewActivatingEventArgs
source: html/39bf2438-9ab7-92b5-ded6-87562898d539.htm
---
# ViewActivatingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.